/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Qualquer data]@";
"%@ %[Today]@" = "%1$@ %2$[Hoje]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Desde ontem]@";
"%@ %[This week]@" = "%1$@ %2$[Esta semana]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Nas últimas 2 semanas]@";
"%@ %[This month]@" = "%1$@ %2$[Este mês]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Nos últimos 2 meses]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Qualquer]@";
"%@ %[Yes]@" = "%1$@ %2$[Sim]@";
"%@ %[No]@" = "%1$@ %2$[Não]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Contém]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Começa por]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Acaba em]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[É]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Exactamente]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Antes]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[após]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Maior que]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Menos que]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Nos últimos]@ %3$@ %4$[Dias]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Nas últimas]@ %3$@ %4$[Semanas]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Nos últimos]@ %3$@ %4$[Meses]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Nos últimos]@ %3$@ %4$[Anos]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Espaço de cor]@ %2$[Qualquer espaço de cor]@";
"%[Color Space]@ %[RGB]@" = "%1$[Espaço de cor]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Espaço de cor]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Espaço de cor]@ %2$[Escala de cinzentos]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Conteúdo]@ contém %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duração]@ %2$[superior a]@ %3$@ %4$[min]@ %5$@ %6$[seg]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duração]@ %2$[inferior a]@ %3$@ %4$[min]@ %5$@ %6$[seg]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Palavras-chave]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Palavras-chave]@ incluem %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Tipo]@ é %2$[qualquer]@";
"%[Kind]@ is %[Images]@" = "%1$[Tipo]@ é %2$[imagens]@";
"%[Kind]@ is %[Text]@" = "%1$[Tipo]@ é %2$[texto]@";
"%[Kind]@ is %[PDF]@" = "%1$[Tipo]@ é %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Tipo]@ é %2$[filmes]@";
"%[Kind]@ is %[Music]@" = "%1$[Tipo]@ é %2$[música]@";
"%[Kind]@ is %[Documents]@" = "%1$[Tipo]@ é %2$[documentos]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Tipo]@ é %2$[apresentações]@";
"%[Kind]@ is %[Folders]@" = "%1$[Tipo]@ é %2$[pastas]@";
"%[Kind]@ is %[Applications]@" = "%1$[Tipo]@ é %2$[aplicações]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Tipo]@ é %2$[outros…]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etiqueta]@ é %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Última abertura]@ %2$[qualquer data]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Última alteração]@ %2$[qualquer data]@";
"%[Created]@ %[Any Date]@" = "%1$[Criação]@ %2$[qualquer data]@";
"%[Last Opened]@ %[Today]@" = "%1$[Última abertura]@ %2$[hoje]@";
"%[Last Modified]@ %[Today]@" = "%1$[Última alteração]@ %2$[hoje]@";
"%[Created]@ %[Today]@" = "%1$[Criação]@ %2$[hoje]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Última abertura]@ %2$[desde ontem]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Última alteração]@ %2$[desde ontem]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Criação]@ %2$[desde ontem]@";
"%[Last Opened]@ %[This week]@" = "%1$[Última abertura]@ %2$[esta semana]@";
"%[Last Modified]@ %[This week]@" = "%1$[Última alteração]@ %2$[esta semana]@";
"%[Created]@ %[This week]@" = "%1$[Criação]@ %2$[esta semana]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Última abertura]@ %2$[nas últimas 2 semanas]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Última alteração]@ %2$[nas últimas 2 semanas]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Criação]@ %2$[nas últimas 2 semanas]@";
"%[Last Opened]@ %[This month]@" = "%1$[Última abertura]@ %2$[este mês]@";
"%[Last Modified]@ %[This month]@" = "%1$[Última alteração]@ %2$[este mês]@";
"%[Created]@ %[This month]@" = "%1$[Criação]@ %2$[este mês]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Última abertura]@ %2$[nos últimos 2 meses]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Última alteração]@ %2$[nos últimos 2 meses]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Criação]@ %2$[nos últimos 2 meses]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Última abertura]@ %2$[exactamente]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Última alteração]@ %2$[exactamente]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Criação]@ %2$[exactamente]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Última abertura]@ %2$[anterior a]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Última alteração]@ %2$[anterior a]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Criação]@ %2$[anterior a]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Última abertura]@ %2$[posterior a]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Última alteração]@ %2$[posterior a]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Criação]@ %2$[posterior a]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última abertura]@ %2$[nos últimos]@ %3$@ %4$[dias]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última alteração]@ %2$[nos últimos]@ %3$@ %4$[dias]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Criação]@ %2$[nos últimos]@ %3$@ %4$[dias]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última abertura]@ %2$[nas últimas]@ %3$@ %4$[semanas]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última alteração]@ %2$[nas últimas]@ %3$@ %4$[semanas]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Criação]@ %2$[nas últimas]@ %3$@ %4$[semanas]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última abertura]@ %2$[nos últimos]@ %3$@ %4$[meses]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última alteração]@ %2$[nos últimos]@ %3$@ %4$[meses]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Criação]@ %2$[nos últimos]@ %3$@ %4$[meses]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última abertura]@ %2$[nos últimos]@ %3$@ %4$[anos]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última alteração]@ %2$[nos últimos]@ %3$@ %4$[anos]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Criação]@ %2$[nos últimos]@ %3$@ %4$[anos]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Género musical]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Extensão do nome]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nome]@ %2$[contém]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nome]@ %2$[Começa por]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nome]@ %2$[acaba em]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nome]@ %2$[é]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientação]@ %2$[qualquer orientação]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientação]@ %2$[horizontal]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientação]@ %2$[vertical]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Outro...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Consulta básica]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Procurar]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibilidade]@ %2$[visível ou invisível]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibilidade]@ %2$[elementos visíveis]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibilidade]@ %2$[elementos invisíveis]@";

